#!/bin/sh

# introduce some variable in shell
A="/dir1/dir2/dir3/my.file.txt"

##########################预定义###############################
echo "使用set命令设定的Flog:$-"
echo "shell本身pid:$$"
echo "最后运行的processID:$!"
echo "上条命令的状态 如果为0正常执行:$!"
echo "命令行的脚本名称:$0"
echo "第几个命令行参数:$1"
echo "命令行参数数量:$#"
echo "所有的命令行参数,空格隔开:$*"
echo "所有的命令行参数,空格隔开,各带引号:$@"

##########################截取################################

# #去除左边 %去除右边 ## %% 最大匹配
# 删第一个/及左边的部分
echo ${A#*/}
# 删最后一个/及左边的部分
echo ${A##*/}
# 删最后一个/及右边边的部分
echo ${A%.*}
# 删第一个/及右边边的部分
echo ${A%%.*}
# 从x向右取y个
echo ${A:x:y}
# 从倒数从x向右取y个
echo ${A:0-x:y}
# 计算长度
echo ${#A}

##########################替换赋值###############################

# 将第一个dir替换为path,不赋值
echo ${A/dir/path}
# 将第所有dir替换为path,不赋值
echo ${A//dir/path}

# 没有设定,用"xyz"返回的值
echo ${A-xyz}
# 没有设定或为空,用"xyz"返回的值
echo ${A:-xyz}

# 设定时,用"xyz"返回的值
echo ${A+xyz}
# 为非空值时,用"xyz"返回的值
echo ${A:+xyz}

# 没设定时,则标准输出
 ${A?xyz}
# 没设定或为空,则标准输出
 ${A:?xyz}

# 没设定时用"xyz"
echo ${A=xyz}
# 没设定或为空时用"xyz"
echo ${A:=xyz}

##########################数组###############################
A=('a' 'b' 'c' 'def')

# 返回数组全部元素
echo ${A[@]}
echo ${A[*]}
# 返回数组第n+1个元素
echo ${A[1]}
# 返回数组元素个数
echo ${#A[@]}
echo ${#A[*]}

##########################$(( ))与整数运算###############################
# 在 $(( )) 中的变量名称,可于其前面加 $ 符号来替换,也可以不用
a=5;b=7;c=2
echo $((a+b*c))
# N为进制，xx为该进制下某个数值，命令执行后可以得到该进制数转成十进制后的值
echo $((N#xx))

# (( ))重定义变量值
a=5;b=7
((a++))
echo $a

((a--))
echo $a

((a<b))
echo $?
